In [1]:
#Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#Loading Data
dataset = load_dataset("lukebarousse/data_jobs")
df = dataset['train'].to_pandas()

#Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [3]:
df.loc[:, 'salary_rate': 'salary_hour_avg']

       salary_rate  salary_year_avg  salary_hour_avg
0             None              NaN              NaN
1             None              NaN              NaN
2             None              NaN              NaN
3             None              NaN              NaN
4             None              NaN              NaN
...            ...              ...              ...
785736        None              NaN              NaN
785737        None              NaN              NaN
785738        None              NaN              NaN
785739        None              NaN              NaN
785740        None              NaN              NaN

[785741 rows x 3 columns]

In [6]:
median_salary_year = df['salary_year_avg'].median()

In [7]:
median_salary_hour = df['salary_hour_avg'].median()

In [8]:
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [10]:
df_filled.loc[:10, 'salary_rate': 'salary_hour_avg']

   salary_rate  salary_year_avg  salary_hour_avg
0         None         115000.0            45.98
1         None         115000.0            45.98
2         None         115000.0            45.98
3         None         115000.0            45.98
4         None         115000.0            45.98
5         None         115000.0            45.98
6         None         115000.0            45.98
7         None         115000.0            45.98
8         None         115000.0            45.98
9         None         115000.0            45.98
10        None         115000.0            45.98

In [15]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

print('Length of original df:    ',len(df_filled))
print('Length of unique df:      ',len(df_unique))
print('Rows Dropped:             ',len(df_filled) - len(df_unique))

Length of original df:     785741
Length of unique df:       785640
Rows Dropped:              101

In [18]:
df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

print('Length of original df:    ',len(df_filled))
print('Length of unique df:      ',len(df_unique))
print('Rows Dropped:             ',len(df_filled) - len(df_unique))

Length of original df:     785741
Length of unique df:       508042
Rows Dropped:              277699

In [20]:
id(df_filled) == id(df_unique)  # Check if the two DataFrames are the same object in memory

False

In [21]:
id(df_filled) == id(df)  # Check if the filled DataFrame is the same as the original DataFrame

True

In [22]:
# id(df_filled) == id(df) because df_filled was initially assigned as df_filled = df,
# so both variables point to the same DataFrame object in memory until modifications are made.

# id(df_filled) != id(df_unique) because df_unique was created by dropping duplicates from df_filled,
# which returns a new DataFrame object, so df_unique points to a different object in memory.